blog/Mac_Start.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Macbook Pro 13</title>
<!-- 2015-03-22 Sun 15:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="forsil" />
</head>
<body>
<div id="content">
<h1 class="title">Macbook Pro 13</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 开箱 Macbook Pro 13 (2015 early)</a></li>
<li><a href="#sec-2">2. 开机</a></li>
<li><a href="#sec-3">3. 启动</a></li>
<li><a href="#sec-4">4. 装软件</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 开箱 Macbook Pro 13 (2015 early)</h2>
<div class="outline-text-2" id="text-1">
<p>
网上很多开箱照，我就不献丑了
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 开机</h2>
<div class="outline-text-2" id="text-2">
<p>
开机之后就是安装界面，一步一步地走就行了。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 启动</h2>
<div class="outline-text-2" id="text-3">
<p>
osx 10.10.2 yosemite，扁平化的图标，粗人一个，不能说出是好是坏，反正不觉得丑就行了。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 装软件</h2>
<div class="outline-text-2" id="text-4">
<p>
进入正题，作为一台开发机器，各种软件是必不可少的，待我细细道来：
</p>

<ul class="org-ul">
<li>xcode: 作为开发机器，xcode 是必须的，不多说
</li>
<li>steam: 游戏虽然不是必须的，但缺少的话总是感觉有点不习惯
<ul class="org-ul">
<li>Dota2: 虽然是个手残菜鸟，但还是要装的
</li>
</ul>
</li>
<li>battle.net: 暴雪的战网客户端，Mac 下也是可以玩炉石，WoW 的，还是原生的哦 <a href="http://dist.blizzard.com/downloads/bna-installers/322d5bb9ae0318de3d4cde7641c96425/beta.3/Battle.net-Beta-Setup-zhCN.zip">下载地址</a>
</li>
<li>shadowsocksX: 你懂的，必需品，从此 Google 有望
</li>
<li>mplayerx: 视频播放器，没怎么用过
</li>
<li>vlc: 也是一款视频播放器
</li>
<li>Google Chrome: 网页浏览器，主要用来看 flash 视频
</li>
<li>Firefox: 同是网页浏览器，以前 Linux 上的主力，在 OSX 上还行
</li>
<li>网易云音乐: 不想下载，只是在线听，特点是资源丰富，而且有许多别人整理的歌单
</li>
<li>dropbox: 网盘，已经习惯了，不打算改
</li>
<li>Thunder: 迅雷，偶尔下载稀缺资源用
</li>
<li>evernote: 资料整理，以前整理的都在这上面
</li>
<li>textmate: OSX 上非常强大的编辑器，虽然我用 emacs，但它还是必须得推荐的
</li>
<li>eamcs: 我的编辑器
</li>
<li>iterm2: 替代 OSX 自带的虚拟终端
</li>
<li>github for mac: 图形查看 github repo 信息
</li>
<li>parallels desktop: 最强虚拟机，小声
</li>
<li>the unarchiver: 解压缩工具，免费的
</li>
<li>kindle: 看 kindle 书籍用
</li>
<li>keepassx: 密码管理器
</li>
<li>dash: api文档管理器，可以查看各种软件 api，可免费
</li>
<li>noizio: 白噪声，免费
</li>
<li>alfred: Mac 最强利器，配合 powerpack，免费的功能和 OSX 自带的 spotlight 差不多，workflow 才是它的魅力所在
<ul class="org-ul">
<li>douban: 搜索豆瓣内容
</li>
<li>flux: 控制 f.lux
</li>
<li>taobao suggest: 淘宝搜索
</li>
<li>v2ex: v2ex 贴子搜索
</li>
<li>workflow searcher: 搜索 workflows
</li>
</ul>
</li>
<li>f.lux: 色温调节
</li>
<li>homebrew: 包管理器，让 OSX 的终端表现与 Linux 一样出色
</li>
<li>zsh: 系统自带，功能强大
<ul class="org-ul">
<li>oh-my-zsh: zsh 的一些配置
</li>
</ul>
</li>
<li>safari 插件: 让 safari 更加强大
<ul class="org-ul">
<li>ublock: 过滤广告
</li>
<li>feedly notifier: feedly rss 更新通知
</li>
<li>wikiwand: 让 wikipedia 更加美丽
</li>
<li>clicktopluginforchina: 让能够支持 html5 播放的视频网站使用 html5 播放，不用煮鸡蛋，获取该插件请在 twitter 上 @ilools
</li>
<li>turn of light: 看视频时周围变暗
</li>
<li>v2ex.ext: v2ex 长贴查看 @ 内容
</li>
<li>youkuhtml5player: 朱一的 “妈妈再也不用担心我发热” 计划
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: forsil</p>
<p class="date">Created: 2015-03-22 Sun 15:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>